app/controllers/api/patients_controller.rb

    def index
        physician_id = params[:id].to_i
        @patients = Patient.where(physician_id: physician_id)
        @patients = @patients.to_a
---
SELECT "patients".* FROM "patients" WHERE "patients"."physician_id" = $1  [["physician_id", 4]]