app/controllers/api/physicians_controller.rb

    def index
        @physicians = Physician.all
---
SELECT "physicians".* FROM "physicians"